In [61]:
import pandas as pd

In [62]:
data = {'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'AmPm': ['Am','Pm','Pm','Pm','Am','Am'],
       'Sales': [200,120,340,124,243,350],
       'Age': [20,12,40,12,46,35]     }

In [63]:
df = pd.DataFrame(data)
df

   Age AmPm Company   Person  Sales
0   20   Am    GOOG      Sam    200
1   12   Pm    GOOG  Charlie    120
2   40   Pm    MSFT      Amy    340
3   12   Pm    MSFT  Vanessa    124
4   46   Am      FB     Carl    243
5   35   Am      FB    Sarah    350

# Group by Value

In [64]:
gp = df.groupby('Company')['Sales']

In [65]:
gp.count()

Company
FB      2
GOOG    2
MSFT    2
Name: Sales, dtype: int64

In [66]:
gv = gp.agg(lambda x: sum([i for i in x if i>200]))

In [67]:
df1 = pd.concat([gp.count(), gp.max(), gp.min(), gp.mean(),gv], axis=1)

In [68]:
df1.columns = 'Count Max Min Mean lambdaSum'.split()
df1

         Count  Max  Min   Mean  lambdaSum
Company
FB           2  350  243  296.5        593
GOOG         2  200  120  160.0          0
MSFT         2  340  124  232.0        340

# Group by two columns

In [69]:
df.groupby(['Company','AmPm'])['Sales'].sum()

Company  AmPm
FB       Am      593
GOOG     Am      200
         Pm      120
MSFT     Pm      464
Name: Sales, dtype: int64

# Group by apply

In [70]:
df.groupby('Company').apply(lambda x: (x.Sales + x.Age).sum()).reset_index(name='Sum')

  Company  Sum
0      FB  674
1    GOOG  352
2    MSFT  516

# Total Sum

In [76]:
df1.loc['total'] = df1.select_dtypes(pd.np.number).sum()
df1

         Count     Max    Min    Mean  lambdaSum
Company
FB         2.0   350.0  243.0   296.5      593.0
GOOG       2.0   200.0  120.0   160.0        0.0
MSFT       2.0   340.0  124.0   232.0      340.0
Total     18.0     NaN    NaN     NaN        NaN
total     48.0  1780.0  974.0  1377.0     1866.0

# describe and transpose

In [13]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [14]:
df.groupby('Company').describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [15]:
df.groupby('Company').describe().transpose()
#.transpose()    #turn row into column and vice versa

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000